---
kind: other
id: Methods.T:Autodesk.Revit.UI.TaskDialog
zh: 提示、弹窗、消息框
source: html/9f1e9744-8327-83a7-54fb-0730d479fb30.htm
---
# TaskDialog Methods

**中文**: 提示、弹窗、消息框

Adds a CommandLink associated to the given id, displaying the indicating main content.